       01 WS-CLIENT.
           05 WS-CLIENT-ID PIC 9(10).
           05 WS-CLIENT-NOM PIC X(255).
           05 WS-CLIENT-PRENOM PIC X(255).
           05 WS-CLIENT-DATE-NAISSANCE PIC X(10).
           05 WS-CLIENT-ADRESSE PIC X(255).
           05 WS-CLIENT-TELEPHONE PIC X(20).
           05 WS-CLIENT-EMAIL PIC X(255).
           05 WS-CLIENT-DATE-CREATION PIC 9(10).