       01 WS-ECHEANCE.
           05 WS-ECHEANCE-ID PIC 9(10).
           05 WS-ECHEANCE-PRET-ID PIC 9(10).
           05 WS-ECHEANCE-NUMERO-MOIS PIC 9(10).
           05 WS-ECHEANCE-DATE-ECHEANCE PIC X(15).
           05 WS-ECHEANCE-MONTANT-PRINCIPAL PIC 9(10)V99.
           05 WS-ECHEANCE-MONTANT-INTERET PIC 9(10)V99.
           05 WS-ECHEANCE-MONTANT-TOTAL PIC 9(10)V99.
           05 WS-ECHEANCE-CAPITAL-RESTANT PIC 9(10)V99.
           05 WS-ECHEANCE-STATUT PIC X(20).