       01 WS-PRET.
           05 WS-PRET-ID PIC 9(10).
		   05 WS-PRET-CLIENT-ID PIC 9(10).
           05 WS-PRET-MONTANT PIC 9(10)V99.
		   05 WS-PRET-TAUX-INTERET PIC 9(3)V99.
		   05 WS-PRET-DUREE-MOIS PIC 9(10).
		   05 WS-PRET-MENSUALITE PIC 9(8)V99.
		   05 WS-PRET-DATE-DEBUT PIC 9(10).
		   05 WS-PRET-STATUT PIC X(15).
		   05 WS-PRET-DATE-CREATION PIC X(10).